Revit 2027 API
TextElementBackground Enumeration
An enumerated type listing all the background mode for the built-in parameter TEXT_BACKGROUND.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum TextElementBackground
Public Enumeration TextElementBackground
public enum class TextElementBackground
type TextElementBackground
Members
Member name | Value | Description
TBGR_OPAQUE | 0 | The TextElement object is opaque.
TBGR_TRANSPARENT | 1 | The TextElement object is transparent.
See Also
Reference
Autodesk.Revit.DB Namespace